window.Strela = function(){
 
 var level = {};
 
 var psd = new b2ParticleSystemDef();
 psd.radius = 0.05;
 psd.dampingStrength = 2;
 var w = world.CreateParticleSystem(psd);
 level.water = w;
 
 level.waterMax = 5;
 level.friction = 10;
 
 level.loadtime = 10000;
 level.time = Date.now() + level.loadtime;
 level.finish = 58;
 
 level.polygons = [
  [ //země
   [ 0.0,+3.0],
   [ 5.0,-1.0],
   [ 7.0,-1.0],
   [ 8.0,+0.0],
   [ 8.0,+0.5],
   [ 9.0,+0.5],
   [ 9.0,+0.2],
   [12.0,+0.2],
   [14.0,+0.1],
   [16.0,-0.1],
   [17.0,-0.5],
   [20.0,-2.5],
   [21.0,-2.8],
   [22.5,-3.0],
   [23.0,-3.0],
   [23.2,-3.1],
   [24.0,-3.5],
   [28.0,-3.2],
   [30.0,-3.2],
   [30.5,-3.0],
   [38.0,-3.0],
   [39.0,-3.5],
   [40.0,-4.5],
   [41.0,-4.7],
   [42.0,-4.5],
   [43.0,-4.0],
   [43.5,-3.7],
   [44.0,-3.6],
   [44.5,-3.6],
   [45.0,-3.7],
   [47.0,-3.9],
   [48.0,-4.0],
   [50.0,-4.1],
   [53.0,-4.0],
   [55.0,-3.4],
   [59.0,-3.2],
   [60.0,-3.2],
   [70.0,-3.0]
  ],
  [ //most
   [40.0,-3.0],
   [42.5,-3.0],
   [42.5,-2.7],
   [40.0,-2.7],
   [40.0,-3.0]
  ],
  [ //zábradlí vlevo
   [40.10,-2.70],
   [40.10,-2.40],
   [40.07,-2.40],
   [40.07,-2.35],
   [40.13,-2.35],
   [40.13,-2.40],
   [40.10,-2.40]
  ],
  [ //zábradlí vpravo
   [42.40,-2.70],
   [42.40,-2.40],
   [42.37,-2.40],
   [42.37,-2.35],
   [42.43,-2.35],
   [42.43,-2.40],
   [42.40,-2.40]
  ],
  [ //auto
   [41.25,-2.55],
   [42.30,-2.55],
   [42.30,-2.35],
   [42.10,-2.05],
   [41.45,-2.05],
   [41.25,-2.35],
   [41.25,-2.55]
  ],
  [ //auto - levé kolo
   [41.30,-2.55],
   [41.30,-2.68],
   [41.40,-2.68],
   [41.40,-2.55]
  ],
  [ //auto - pravé kolo
   [42.25,-2.55],
   [42.25,-2.68],
   [42.15,-2.68],
   [42.15,-2.55]
  ],
  [ //občerstvení - základ
   [59.0,-3.2],
   [59.0,-2.8],
   [60.0,-2.8],
   [60.0,-3.2]
  ],
  [ //občerstvení - střecha
   [59.0,-2.2],
   [60.0,-2.25],
   [60.0,-2.35],
   [59.0,-2.3],
   [59.0,-2.2]
  ],
  [
   [59.05,-2.8],
   [59.05,-2.3]
  ],
  [
   [59.95,-2.8],
   [59.95,-2.35]
  ],
  [ //obečerstvení - stickman
   [59.32,-2.77],
   [59.24,-2.74],
   [59.24,-2.66],
   [59.32,-2.63],
   [59.37,-2.70],
   [59.32,-2.77],
   [59.32,-2.80]
  ]
 ];
 
 level.stream = [
  Stream( w, Circle(+ 2.0, +3.0, .5 ), Vector( .1,  0), 0.50, 50, 1),
  Stream( w, Circle(+ 1.0, +3.0, .5 ), Vector(  0,  0), 0.50, 50, 1),
  Stream( w, Circle(+23.8, -3.0, .2 ), Vector( .2,  0), 0.25,100, 1)
 ];
 
 level.slack = [
  SlackWater( w, Rect(  5,  1, 3, 2 ) ),
  SlackWater( w, Rect( 27, -2, 5, 1 ) ),
  SlackWater( w, Rect( 41, -4, 2, 1 ) ),
  SlackWater( w, Rect( 50, -3, 5, 1 ) )
 ];
 
 level.ready = false;
 
 level.load = function(){
  level.time = Date.now();
  level.ready = true;
  kayak.SetTransform(new b2Vec2(10,2),0);
  kayak.SetLinearVelocity(new b2Vec2(0,0));
  kayak.SetAngularVelocity(0);
 };
 
 level.reload = function(){
  level.ready = false;
  level.load();
 };
 
 return level;
 
};
